---
kind: type
id: T:Autodesk.Revit.DB.ConnectorSet
source: html/a9821fc1-54cf-5f69-13a9-25d506ecb048.htm
---
# Autodesk.Revit.DB.ConnectorSet

A set that can contain any type of object.

## Syntax (C#)
```csharp
public class ConnectorSet : APIObject,
	IEnumerable
```